[{
  "id": 1,
  "joke": "Chuck Norris uses ribbed condoms inside out, so he gets the pleasure.",
  "categories": ["explicit"]
}, {
  "id": 2,
  "joke": "MacGyver can build an airplane out of gum and paper clips. Chuck Norris can kill him and take it.",
  "categories": []
}, {
  "id": 3,
  "joke": "Chuck Norris doesn't read books. He stares them down until he gets the information he wants.",
  "categories": []
}, {
  "id": 4,
  "joke": "If you ask Chuck Norris what time it is, he always answers &quot;Two seconds till&quot;. After you ask &quot;Two seconds to what?&quot;, he roundhouse kicks you in the face.",
  "categories": []
}, {
  "id": 5,
  "joke": "Chuck Norris lost his virginity before his dad did.",
  "categories": ["explicit"]
}, {
  "id": 6,
  "joke": "Since 1940, the year Chuck Norris was born, roundhouse kick related deaths have increased 13,000 percent.",
  "categories": []
}, {
  "id": 12,
  "joke": "Chuck Norris sheds his skin twice a year.",
  "categories": []
}, {
  "id": 13,
  "joke": "Chuck Norris once challenged Lance Armstrong in a &quot;Who has more testicles?&quot; contest. Chuck Norris won by 5.",
  "categories": ["explicit"]
}, {
  "id": 14,
  "joke": "There are no steroids in baseball. Just players Chuck Norris has breathed on.",
  "categories": []
}, {
  "id": 15,
  "joke": "When Chuck Norris goes to donate blood, he declines the syringe, and instead requests a hand gun and a bucket.",
  "categories": []
}, {
  "id": 16,
  "joke": "Pluto is actually an orbiting group of British soldiers from the American Revolution who entered space after the Chuck gave them a roundhouse kick to the face.",
  "categories": []
}, {
  "id": 17,
  "joke": "Chuck Norris does not teabag the ladies. He potato-sacks them.",
  "categories": ["explicit"]
}, {
  "id": 18,
  "joke": "According to the Encyclopedia Brittanica, the Native American &quot;Trail of Tears&quot; has been redefined as anywhere that Chuck Norris walks.",
  "categories": []
}, {
  "id": 19,
  "joke": "In an average living room there are 1,242 objects Chuck Norris could use to kill you, including the room itself.",
  "categories": []
}, {
  "id": 20,
  "joke": "The Chuck Norris military unit was not used in the game Civilization 4, because a single Chuck Norris could defeat the entire combined nations of the world in one turn.",
  "categories": ["nerdy"]
}, {
  "id": 21,
  "joke": "Chuck Norris doesn't shower, he only takes blood baths.",
  "categories": []
}, {
  "id": 23,
  "joke": "Time waits for no man. Unless that man is Chuck Norris.",
  "categories": []
}, {
  "id": 24,
  "joke": "Chuck Norris can hit you so hard that he can actually alter your DNA. Decades from now your descendants will occasionally clutch their heads and yell &quot;What The Hell was That?&quot;.",
  "categories": []
}, {
  "id": 25,
  "joke": "In the Bible, Jesus turned water into wine. But then Chuck Norris turned that wine into beer.",
  "categories": []
}, {
  "id": 26,
  "joke": "Chuck Norris is the only human being to display the Heisenberg uncertainty principle - you can never know both exactly where and how quickly he will roundhouse-kick you in the face.",
  "categories": ["nerdy"]
}, {
  "id": 27,
  "joke": "Faster than a speeding bullet... More powerful than a locomotive... Able to leap tall buildings in a single bound... These are some of Chuck Norris's warm-up exercises.",
  "categories": []
}, {
  "id": 28,
  "joke": "Chuck Norris is not hung like a horse. Horses are hung like Chuck Norris.",
  "categories": []
}, {
  "id": 29,
  "joke": "Teenage Mutant Ninja Turtles is based on a true story: Chuck Norris once swallowed a turtle whole, and when he crapped it out, the turtle was six feet tall and had learned karate.",
  "categories": []
}, {
  "id": 30,
  "joke": "Someone once tried to tell Chuck Norris that roundhouse kicks aren't the best way to kick someone. This has been recorded by historians as the worst mistake anyone has ever made.",
  "categories": []
}, {
  "id": 31,
  "joke": "Chuck Norris has two speeds: Walk and Kill.",
  "categories": []
}, {
  "id": 33,
  "joke": "Chuck Norris once shot down a German fighter plane with his finger. By yelling &quot;Bang!&quot;",
  "categories": []
}, {
  "id": 34,
  "joke": "The opening scene of the movie &quot;Saving Private Ryan&quot; is loosely based on games of dodgeball Chuck Norris played in second grade.",
  "categories": []
}, {
  "id": 35,
  "joke": "Fool me once, shame on you. Fool Chuck Norris once and he will roundhouse kick you in the face.",
  "categories": []
}, {
  "id": 36,
  "joke": "Chuck Norris originally appeared in the &quot;Street Fighter II&quot; video game, but was removed by Beta Testers because every button caused him to do a roundhouse kick. When asked about this glitch, Norris replied &quot;That's no glitch.&quot;",
  "categories": ["nerdy"]
}, {
  "id": 37,
  "joke": "If you spell Chuck Norris in Scrabble, you win. Forever.",
  "categories": []
}, {
  "id": 38,
  "joke": "Someone once videotaped Chuck Norris getting pissed off. It was called Walker: Texas Chain Saw Masacre.",
  "categories": []
}, {
  "id": 39,
  "joke": "Chuck Norris will attain statehood in 2009. His state flower will be the Magnolia.",
  "categories": []
}, {
  "id": 40,
  "joke": "A handicapped parking sign does not signify that this spot is for handicapped people. It is actually in fact a warning, that the spot belongs to Chuck Norris and that you will be handicapped if you park there.",
  "categories": []
}, {
  "id": 41,
  "joke": "Chuck Norris doesn't wash his clothes. He disembowels them.",
  "categories": []
}, {
  "id": 42,
  "joke": "Chuck Norris doesn't churn butter. He roundhouse kicks the cows and the butter comes straight out.",
  "categories": []
}, {
  "id": 43,
  "joke": "Police label anyone attacking Chuck Norris as a Code 45-11.... A suicide.",
  "categories": []
}, {
  "id": 44,
  "joke": "Chuck Norris is the only man to ever defeat a brick wall in a game of tennis.",
  "categories": []
}, {
  "id": 45,
  "joke": "What was going through the minds of all of Chuck Norris' victims before they died? His shoe.",
  "categories": []
}, {
  "id": 46,
  "joke": "Chuck Norris once ate three 72 oz. steaks in one hour. He spent the first 45 minutes having sex with his waitress.",
  "categories": ["explicit"]
}, {
  "id": 47,
  "joke": "There is no theory of evolution, just a list of creatures Chuck Norris allows to live.",
  "categories": []
}, {
  "id": 48,
  "joke": "Chuck Norris can win a game of Connect Four in only three moves.",
  "categories": []
}, {
  "id": 49,
  "joke": "CNN was originally created as the &quot;Chuck Norris Network&quot; to update Americans with on-the-spot ass kicking in real-time.",
  "categories": []
}, {
  "id": 50,
  "joke": "Chuck Norris invented Kentucky Fried Chicken's famous secret recipe with eleven herbs and spices. Nobody ever mentions the twelfth ingredient: Fear.",
  "categories": []
}, {
  "id": 51,
  "joke": "The quickest way to a man's heart is with Chuck Norris' fist.",
  "categories": []
}, {
  "id": 52,
  "joke": "When Chuck Norris sends in his taxes, he sends blank forms and includes only a picture of himself, crouched and ready to attack. Chuck Norris has not had to pay taxes, ever.",
  "categories": []
}, {
  "id": 53,
  "joke": "Chuck Norris drives an ice cream truck covered in human skulls.",
  "categories": []
}, {
  "id": 55,
  "joke": "Most people have 23 pairs of chromosomes. Chuck Norris has 72... and they're all poisonous.",
  "categories": []
}, {
  "id": 56,
  "joke": "The Great Wall of China was originally created to keep Chuck Norris out. It failed miserably.",
  "categories": []
}, {
  "id": 57,
  "joke": "Chuck Norris is ten feet tall, weighs two-tons, breathes fire, and could eat a hammer and take a shotgun blast standing.",
  "categories": []
}, {
  "id": 58,
  "joke": "Crop circles are Chuck Norris' way of telling the world that sometimes corn needs to lie down.",
  "categories": []
}, {
  "id": 59,
  "joke": "Chuck Norris once roundhouse kicked someone so hard that his foot broke the speed of light, went back in time, and killed Amelia Earhart while she was flying over the Pacific Ocean.",
  "categories": []
}, {
  "id": 60,
  "joke": "When Chuck Norris calls 1-900 numbers, he doesn't get charged. He holds up the phone and money falls out.",
  "categories": []
}, {
  "id": 61,
  "joke": "Chuck Norris once ate a whole cake before his friends could tell him there was a stripper in it.",
  "categories": []
}, {
  "id": 62,
  "joke": "Some people like to eat frogs' legs. Chuck Norris likes to eat lizard legs. Hence, snakes.",
  "categories": []
}, {
  "id": 64,
  "joke": "There are no races, only countries of people Chuck Norris has beaten to different shades of black and blue.",
  "categories": []
}, {
  "id": 65,
  "joke": "When Chuck Norris was denied an Egg McMuffin at McDonald's because it was 10:35, he roundhouse kicked the store so hard it became a Wendy's.",
  "categories": []
}, {
  "id": 66,
  "joke": "Chuck Norris can't finish a &quot;color by numbers&quot; because his markers are filled with the blood of his victims. Unfortunately, all blood is dark red.",
  "categories": []
}, {
  "id": 67,
  "joke": "A Chuck Norris-delivered Roundhouse Kick is the preferred method of execution in 16 states.",
  "categories": []
}, {
  "id": 68,
  "joke": "When Chuck Norris falls in water, Chuck Norris doesn't get wet. Water gets Chuck Norris.",
  "categories": []
}, {
  "id": 69,
  "joke": "Scientists have estimated that the energy given off during the Big Bang is roughly equal to 1CNRhK (Chuck Norris Roundhouse Kick).",
  "categories": ["nerdy"]
}, {
  "id": 70,
  "joke": "Chuck Norris' house has no doors, only walls that he walks through.",
  "categories": []
}, {
  "id": 71,
  "joke": "When Chuck Norris has sex with a man, it won't be because he is gay. It will be because he has run out of women.",
  "categories": ["explicit"]
}, {
  "id": 72,
  "joke": "How much wood would a woodchuck chuck if a woodchuck could Chuck Norris? All of it.",
  "categories": []
}, {
  "id": 73,
  "joke": "Chuck Norris doesn't actually write books, the words assemble themselves out of fear.",
  "categories": []
}, {
  "id": 74,
  "joke": "In honor of Chuck Norris, all McDonald's in Texas have an even larger size than the super-size. When ordering, just ask to be Chucksized.",
  "categories": []
}, {
  "id": 75,
  "joke": "Chuck Norris can believe it's not butter.",
  "categories": []
}, {
  "id": 76,
  "joke": "If tapped, a Chuck Norris roundhouse kick could power the country of Australia for 44 minutes.",
  "categories": []
}, {
  "id": 77,
  "joke": "Chuck Norris can divide by zero.",
  "categories": []
}, {
  "id": 78,
  "joke": "The grass is always greener on the other side, unless Chuck Norris has been there. In that case the grass is most likely soaked in blood and tears.",
  "categories": []
}, {
  "id": 80,
  "joke": "Newton's Third Law is wrong: Although it states that for each action, there is an equal and opposite reaction, there is no force equal in reaction to a Chuck Norris roundhouse kick.",
  "categories": []
}, {
  "id": 81,
  "joke": "Chuck Norris invented his own type of karate. It's called Chuck-Will-Kill.",
  "categories": []
}, {
  "id": 82,
  "joke": "When an episode of Walker Texas Ranger was aired in France, the French surrendered to Chuck Norris just to be on the safe side.",
  "categories": []
}, {
  "id": 83,
  "joke": "While urinating, Chuck Norris is easily capable of welding titanium.",
  "categories": []
}, {
  "id": 84,
  "joke": "When Chuck Norris talks, everybody listens. And dies.",
  "categories": []
}, {
  "id": 85,
  "joke": "When Steven Seagal kills a ninja, he only takes its hide. When Chuck Norris kills a ninja, he uses every part.",
  "categories": []
}, {
  "id": 86,
  "joke": "Wilt Chamberlain claims to have slept with more than 20,000 women in his lifetime. Chuck Norris calls this &quot;a slow Tuesday.&quot;",
  "categories": []
}, {
  "id": 87,
  "joke": "Contrary to popular belief, there is indeed enough Chuck Norris to go around.",
  "categories": []
}, {
  "id": 88,
  "joke": "Chuck Norris doesnt shave; he kicks himself in the face. The only thing that can cut Chuck Norris is Chuck Norris.",
  "categories": []
}, {
  "id": 89,
  "joke": "For some, the left testicle is larger than the right one. For Chuck Norris, each testicle is larger than the other one.",
  "categories": ["explicit"]
}, {
  "id": 90,
  "joke": "Chuck Norris always knows the EXACT location of Carmen SanDiego.",
  "categories": []
}, {
  "id": 91,
  "joke": "When taking the SAT, write &quot;Chuck Norris&quot; for every answer. You will score over 8000.",
  "categories": []
}, {
  "id": 92,
  "joke": "Chuck Norris invented black. In fact, he invented the entire spectrum of visible light. Except pink. Tom Cruise invented pink.",
  "categories": []
}, {
  "id": 93,
  "joke": "When you're Chuck Norris, anything + anything is equal to 1. One roundhouse kick to the face.",
  "categories": []
}, {
  "id": 94,
  "joke": "Chuck Norris has the greatest Poker-Face of all time. He won the 1983 World Series of Poker, despite holding only a Joker, a Get out of Jail Free Monopoloy card, a 2 of clubs, 7 of spades and a green #4 card from the game UNO.",
  "categories": []
}, {
  "id": 95,
  "joke": "On his birthday, Chuck Norris randomly selects one lucky child to be thrown into the sun.",
  "categories": []
}, {
  "id": 96,
  "joke": "Nobody doesn't like Sara Lee. Except Chuck Norris.",
  "categories": []
}, {
  "id": 97,
  "joke": "Chuck Norris doesn't throw up if he drinks too much. Chuck Norris throws down!",
  "categories": []
}, {
  "id": 98,
  "joke": "In the beginning there was nothing...then Chuck Norris Roundhouse kicked that nothing in the face and said &quot;Get a job&quot;. That is the story of the universe.",
  "categories": []
}, {
  "id": 99,
  "joke": "Chuck Norris has 12 moons. One of those moons is the Earth.",
  "categories": []
}, {
  "id": 100,
  "joke": "Chuck Norris grinds his coffee with his teeth and boils the water with his own rage.",
  "categories": []
}]